import { CycleDTO } from '../../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 113,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 60 }],
  },
  {
    技能名称: '破',
    技能数量: 113,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 60 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 600,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 300 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 14,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 12 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 14,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 12 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 56,
    技能增益列表: [
      { 增益名称: '灭影追风,雨积', 增益技能数: 14 },
      { 增益名称: '灭影追风', 增益技能数: 28 },
    ],
  },
  {
    技能名称: '留客雨',
    技能数量: 84,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 42 }],
  },
  {
    技能名称: '停云势',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '决云势',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 7,
  },
  {
    技能名称: '触石雨',
    技能数量: 6,
  },
  {
    技能名称: '断云势',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 60 }],
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 140,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 22 }],
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 14 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 14,
  },
  {
    技能名称: '流血·四',
    技能数量: 143,
  },
  {
    技能名称: '流血·三',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '聚疏',
  '雨积',
  '放皓',
  '电逝',
  '击懈',
  '界破',
  '长溯',
  '涣衍',
  '连亘',
  '流岚',
  '潋风',
]
