import { CycleDTO } from '../../../@types/cycle'

const weisheng_cang_cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 153,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '破',
    技能数量: 153,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '截辕',
    技能数量: 39,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '截辕（DOT）',
    技能数量: 147,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 420,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 130 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 11,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 6 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 10,
  },
  {
    技能名称: '行云势·三',
    技能数量: 10,
  },
  {
    技能名称: '留客雨',
    技能数量: 42,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '停云势',
    技能数量: 25,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 4 }],
  },
  {
    技能名称: '决云势',
    技能数量: 49,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 8 }],
  },
  {
    技能名称: '凝神势·破锋',
    技能数量: 6,
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 7,
  },
  {
    技能名称: '触石雨',
    技能数量: 6,
  },
  {
    技能名称: '断云势',
    技能数量: 23,
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 23,
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 38,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 38,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 38,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 2,
  },
  {
    技能名称: '流血·四',
    技能数量: 6,
  },
]

export default weisheng_cang_cycle
