import { CycleDTO } from '../../../@types/cycle'

const weisheng_cang_cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 145,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 70 }],
  },
  {
    技能名称: '破',
    技能数量: 145,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 70 }],
  },
  {
    技能名称: '截辕',
    技能数量: 36,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '截辕（DOT）',
    技能数量: 147,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 100,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 50 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 13,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 2 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 8,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 2 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 8,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 2 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 45,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '停云势',
    技能数量: 21,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 4 }],
  },
  {
    技能名称: '决云势',
    技能数量: 49,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 8 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 7,
  },
  {
    技能名称: '触石雨',
    技能数量: 6,
  },
  {
    技能名称: '断云势',
    技能数量: 21,
    技能增益列表: [
      // { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      // { 增益名称: '镇机·破绽四', 增益技能数: 20 },
    ],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 21,
    技能增益列表: [
      // { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      // { 增益名称: '镇机·破绽四', 增益技能数: 20 },
    ],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 36 + 8 + 12 + 4 + 24,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 + 8 + 12 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 36 + 8 + 6 + 4 + 12,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 + 8 + 6 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 36 + 6 + 12,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 + 6 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 70 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 14,
  },
  // {
  //   技能名称: '流血·四',
  //   技能数量: 42,
  // },
]

export default weisheng_cang_cycle
