import { CycleDTO } from '../../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    统计用技能名称: '孤锋破浪（CW期间）',
    技能数量: 5,
  },
  {
    技能名称: '破',
    统计用技能名称: '破（CW期间）',
    技能数量: 5,
  },
  {
    技能名称: '避实击虚',
    统计用技能名称: '避实击虚（CW期间）',
    技能数量: 1,
  },
  {
    技能名称: '界破',
    技能数量: 2,
    统计用技能名称: '界破（CW期间）',
  },
  {
    技能名称: '沧浪三叠·一',
    统计用技能名称: '沧浪三叠·一（CW期间）',
    技能数量: 1,
  },
  {
    技能名称: '沧浪三叠·二',
    统计用技能名称: '沧浪三叠·二（CW期间）',
    技能数量: 1,
  },
  {
    技能名称: '沧浪三叠·三',
    统计用技能名称: '沧浪三叠·三（CW期间）',
    技能数量: 1,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '聚疏',
  '雨积',
  '放皓',
  '电逝',
  '击懈',
  '界破',
  '鸣锋',
  '涣衍',
  '连亘',
  '流岚',
  '潋风',
]
