export default [
  {
    version: '2.1.4',
    date: '2023-12-07 17:30:00',
    content: ['更新增益劲风破风的数值为1397（奇穴描述是33%实际并不是）'],
  },
  {
    version: '2.1.3',
    content: ['更新阵眼计算无双相关的计算错误。感谢霸刀考拉大佬的捉虫'],
  },
  {
    version: '2.1.2',
    content: ['增加了阵眼收益动态显示，基于当前属性动态计算，按从高到底排序'],
  },
  {
    version: '2.1.0',
    content: [
      '万灵当歌版本技改，大量循环变动',
      '增加奇穴切换功能',
      '将强膂移动至奇穴切换功能',
      '增加万灵阵',
      '修改刀宗非侠系数6%=>10%',
      '由于奇穴和循环的变动，在开始使用前需要重新依次检查配装器、循环、奇穴配置以保证你的数据准确',
      '增加了一个属性优化算法，详情见描述（beta）',
    ],
  },
  {
    version: '2.0.5',
    content: [
      '修复了大橙武对孤锋破浪的5%伤害加成未生效问题',
      '重构了dps计算部分的代码逻辑，使其计算流程更加合理',
      '由于本次对部分装备增益的变量名称有修改，看到版本更新后请重新打开配装器，点击保存并计算刷新配装',
    ],
  },
  {
    version: '2.0.4',
    content: [
      '修复了力道加成破防在计算最终dps时的系数偏差',
      '该偏差使最终dps数字比实际略低一千左右，（不影响收益显示）',
    ],
  },
  {
    version: '2.0.3',
    content: [
      '7月31日技改更新',
      '刀宗喜提非侠6%',
      '孤锋破浪技能伤害调整：降低10%',
      '橙武增强 ≈ 3%',
      '周流增强 ≈ 3.5%',
      '驭耀增强 ≈ 4%',
    ],
  },
  {
    version: '2.0.2',
    content: ['6月19日技改更新', '断云势伤害降低10%'],
  },
  {
    version: '2.0.1',
    content: [
      '5月15日技改更新',
      '流岚无视防御35% => 40%',
      '横云断浪伤害降低20%',
      '截辕伤害和截辕DOT伤害降低25%',
      '系数为公告描述系数，实际更新后根据实测数值调整',
      '修复了11150破破暗器和12450暗器名称错误的问题',
      '总结：dps基本没变化',
    ],
  },
  {
    version: '2.0.0',
    content: [
      '循环内镇机改为界破',
      '优化了循环类型，目前只有驭耀和周流两个选项',
      '配装器选择CW且循环为周流时自动启用CW循环',
      '修改驭耀循环的战斗计算时间',
      '修改孤锋断浪系数（-15%）',
      '修改梅花三弄增益计算（默认80层）',
      '修改左旋右转增益计算（默认80层）',
      '新增本赛季副本、试炼装备',
      '新增本赛季紫色附魔',
      '增加最优推荐功能（娱乐功能，持续完善中）',
      '增加了开启/关闭背景功能',
      '大CW循环待定',
    ],
  },
  {
    version: '1.2.4',
    content: ['新增暗器“择逸录·扶”'],
  },
  {
    version: '1.2.3',
    content: ['修复了由于装备ID相同导致选择10900无封项链（会招）时，异常携带龙门武器特效的问题'],
  },
  {
    version: '1.2.2',
    content: ['新增龙门特效武器四绝分海刀'],
  },
  {
    version: '1.2.1',
    content: [
      '新增冬至装备岚峰·刀功系列',
      '增益新增冬至武器特效“吟冬卧雪”',
      '移动配装器“启用强膂”选项的位置',
    ],
  },
  {
    version: '1.2.0',
    content: [
      '12月12日技改后更新',
      '重新调整所有循环。(计算前请重新选择循环！！！)',
      '暂时删除周纵循环（如果还有救等待优化后恢复）',
      '删除周流141横等循环，后续周流只留一个循环作为参考',
    ],
  },
  {
    version: '1.1.9',
    content: ['调整决云势技能伤害系数：0.40625 => 1.175'],
  },
  {
    version: '1.1.8',
    content: ['为避免首次使用者误解，增益弹窗改为默认展开。（依然可以手动关闭）'],
  },
  {
    version: '1.1.7',
    content: ['调整孤锋破浪技能伤害系数（降低10%）'],
  },
  {
    version: '1.1.6',
    content: ['删除菜周', '增加周纵1.0循环', '修复CW循环计算截辕伤害异常的问题'],
  },
  {
    version: '1.1.5',
    content: ['隐藏了属性录入功能', '内置配装器内新增魔盒配装方案导入功能，敬请体验'],
  },
  {
    version: '1.1.4',
    content: [
      '配装器戒指增加橙戒',
      '删除驭耀3.0',
      '增加大CW特效行云势·神兵',
      '新增娱乐CW循环（风雪哥哥提供）',
    ],
  },
  {
    version: '1.1.3',
    content: [
      '更新了大附魔',
      '注：伤衣、伤帽数值目前按普通大附魔数值计算的，和10人大附魔实际dps差距很小。',
      '注：伤腕、伤鞋大附魔系数待实测，切勿根据此2大附魔调整配装',
    ],
  },
  {
    version: '1.1.2',
    content: [
      '配装器内增加了装备推荐，个人想法仅供参考',
      '切换装备推荐没有切换循环，切勿直接对比驭耀和周流的dps差异',
    ],
  },
  {
    version: '1.1.1',
    content: [
      '更新左旋右转的默认覆盖率为90% => 100%',
      '更新左旋右转的破招增加数值为 1800 => 4500',
      '更新秋肃的增伤5% => 6%',
      '更新仙王蛊鼎的增伤8% => 12%',
      '6750品小CW新增“沧浪三叠5%会心”增益',
      '大CW新增“沧浪三叠5%伤害”、“孤锋破浪5%伤害"增益',
      '新增清除缓存选项，计算器异常时可以尝试尝试缓存',
    ],
  },
  {
    version: '1.1.0',
    content: [
      '本版本调整后对收益有巨大影响，之前计算方式有问题，感谢七海大佬、平泽唯大佬的捉虫。学艺不精计算失误非常抱歉',
      '调整了增益的计算，把同类增益合并到一起计算而不是相乘',
      '删除了实战基本无法吃到的配伍增益',
    ],
  },
  {
    version: '1.0.8',
    content: [
      '优化了增益的计算方式，改为通过不郭氏计算计算单点收益',
      '由于小药、附魔等数值比例不统一，增加多种查看选择',
      '优化了各种增益的计算顺序',
      '优化计算dps算法，使计算伤害算法更加合理',
    ],
  },
  {
    version: '1.0.7',
    content: ['更新了团队增益选项，新增：酒中仙、剑锋百锻、炽炎、疏狂、戒火斩、皎肃、乘龙箭、虚弱'],
  },
  {
    version: '1.0.6',
    content: [
      '循环新增了平民周流循环',
      '调整加速和网络延迟的影响',
      '目前二段加速循环需要更改，暂时只推荐一段加速配装',
      '暂时不推荐使用属性录入选项，后续会推出魔盒导入能力',
    ],
  },
  {
    version: '1.0.5',
    content: [
      '修复了25普通装备套装效果加成未计算的问题',
      '修复了25英雄套装效果默认计算的问题',
      '修复了切糕装备属性未计算的问题',
      '新增了食品增强、药品增强的加速小药',
      '修复家园加速酒数值异常的问题',
      '优化了配装器内的装备套装效果显示',
    ],
  },
  {
    version: '1.0.4',
    content: ['更新驭耀4.0循环', '更新周流3.0循环', '增加延迟/加速计算'],
  },
  {
    version: '1.0.3',
    content: ['更新正式服流岚计算', '更新临时驭耀假想循环（由777大佬提供）'],
  },
  {
    version: '1.0.2',
    content: ['更新周流循环', '配装器内新增dps对比能力'],
  },
  {
    version: '1.0.1',
    content: ['更新装备属性、名称', '添加绝地天通刀(无特效)'],
  },
  {
    version: '1.0.0',
    content: ['发布1.0正式版', '更新团队增益、小吃等'],
  },
  {
    version: '0.0.7',
    content: [
      '修改了孤锋破浪的武器伤害系数100% => 250%',
      '更新溃延循环计算（默认打完循环4分52秒）',
      '更新体服最新附魔，更新了计算收益时的附魔数值',
    ],
  },
  {
    version: '0.0.6',
    content: '更新流岚计算，默认内置了流岚和2件套的加成',
  },
  {
    version: '0.0.5',
    content: '放开增益选项，开放阵眼选择能力',
  },
  {
    version: '0.0.4',
    content: ['优化了镶嵌五行石选项、五彩石的颜色，使其更易分别', '更新所有技能会心秘籍的计算算法'],
  },
  {
    version: '0.0.3',
    content: '新增内置配装器，帮助更快设置自身属性',
  },
  {
    version: '0.0.2',
    content: '计算器UI改版，布局样式参考了各门派计算器',
  },
  {
    version: '0.0.1',
    content: '初始化计算器',
  },
]
