export default [
  {
    version: '1.1.2',
    content: [
      '配装器内增加了装备推荐，个人想法仅供参考',
      '切换装备推荐没有切换循环，切勿直接对比驭耀和周流的dps差异',
    ],
  },
  {
    version: '1.1.1',
    content: [
      '更新左旋右转的默认覆盖率为90% => 100%',
      '更新左旋右转的破招增加数值为 1800 => 4500',
      '更新秋肃的增伤5% => 6%',
      '更新仙王蛊鼎的增伤8% => 12%',
      '6750品小CW新增“沧浪三叠5%会心”增益',
      '大CW新增“沧浪三叠5%伤害”、“孤锋破浪5%伤害"增益',
      '新增清除缓存选项，计算器异常时可以尝试尝试缓存',
    ],
  },
  {
    version: '1.1.0',
    content: [
      '本版本调整后对收益有巨大影响，之前计算方式有问题，感谢七海大佬、平泽唯大佬的捉虫。学艺不精计算失误非常抱歉',
      '调整了增益的计算，把同类增益合并到一起计算而不是相乘',
      '删除了实战基本无法吃到的配伍增益',
    ],
  },
  {
    version: '1.0.8',
    content: [
      '优化了增益的计算方式，改为通过不郭氏计算计算单点收益',
      '由于小药、附魔等数值比例不统一，增加多种查看选择',
      '优化了各种增益的计算顺序',
      '优化计算dps算法，使计算伤害算法更加合理',
    ],
  },
  {
    version: '1.0.7',
    content: ['更新了团队增益选项，新增：酒中仙、剑锋百锻、炽炎、疏狂、戒火斩、皎肃、乘龙箭、虚弱'],
  },
  {
    version: '1.0.6',
    content: [
      '循环新增了平民周流循环',
      '调整加速和网络延迟的影响',
      '目前二段加速循环需要更改，暂时只推荐一段加速配装',
      '暂时不推荐使用属性录入选项，后续会推出魔盒导入能力',
    ],
  },
  {
    version: '1.0.5',
    content: [
      '修复了25普通装备套装效果加成未计算的问题',
      '修复了25英雄套装效果默认计算的问题',
      '修复了切糕装备属性未计算的问题',
      '新增了食品增强、药品增强的加速小药',
      '修复家园加速酒数值异常的问题',
      '优化了配装器内的装备套装效果显示',
    ],
  },
  {
    version: '1.0.4',
    content: ['更新驭耀4.0循环', '更新周流3.0循环', '增加延迟/加速计算'],
  },
  {
    version: '1.0.3',
    content: ['更新正式服流岚计算', '更新临时驭耀假想循环（由777大佬提供）'],
  },
  {
    version: '1.0.2',
    content: ['更新周流循环', '配装器内新增dps对比能力'],
  },
  {
    version: '1.0.1',
    content: ['更新装备属性、名称', '添加绝地天通刀(无特效)'],
  },
  {
    version: '1.0.0',
    content: ['发布1.0正式版', '更新团队增益、小吃等'],
  },
  {
    version: '0.0.7',
    content: [
      '修改了孤锋破浪的武器伤害系数100% => 250%',
      '更新溃延循环计算（默认打完循环4分52秒）',
      '更新体服最新附魔，更新了计算收益时的附魔数值',
    ],
  },
  {
    version: '0.0.6',
    content: '更新流岚计算，默认内置了流岚和2件套的加成',
  },
  {
    version: '0.0.5',
    content: '放开增益选项，开放阵眼选择能力',
  },
  {
    version: '0.0.4',
    content: ['优化了镶嵌五行石选项、五彩石的颜色，使其更易分别', '更新所有技能会心秘籍的计算算法'],
  },
  {
    version: '0.0.3',
    content: '新增内置配装器，帮助更快设置自身属性',
  },
  {
    version: '0.0.2',
    content: '计算器UI改版，布局样式参考了各门派计算器',
  },
  {
    version: '0.0.1',
    content: '初始化计算器',
  },
]
