export default [
  {
    version: '1.0.0',
    content: ['发布1.0正式版', '更新团队增益、小吃等'],
  },
  {
    version: '0.0.7',
    content: [
      '修改了孤锋破浪的武器伤害系数100% => 250%',
      '更新溃延循环计算（默认打完循环4分52秒）',
      '更新体服最新附魔，更新了计算收益时的附魔数值',
    ],
  },
  {
    version: '0.0.6',
    content: '更新流岚计算，默认内置了流岚和2件套的加成',
  },
  {
    version: '0.0.5',
    content: '放开增益选项，开放阵眼选择能力',
  },
  {
    version: '0.0.4',
    content: ['优化了镶嵌五行石选项、五彩石的颜色，使其更易分别', '更新所有技能会心秘籍的计算算法'],
  },
  {
    version: '0.0.3',
    content: '新增内置配装器，帮助更快设置自身属性',
  },
  {
    version: '0.0.2',
    content: '计算器UI改版，布局样式参考了各门派计算器',
  },
  {
    version: '0.0.1',
    content: '初始化计算器',
  },
]
