export default [
  {
    version: '3.1.2_雾海寻龙',
    date: '2024-04-29 17:10:00',
    content: [
      '功能修复',
      <p key='3.1.2_雾海寻龙_功能修复' style={{ paddingLeft: 12 }}>
        <p>修正了等级减伤的计算公式为非郭氏计算，理论dps提升了</p>
        <p>例：原来124木桩减少计算为 (1-204/1024) 现在为 (1-0.2)</p>
        <p>增加了一种新的伤害计算类型【真实伤害】无法会心，只吃秋肃和等级减伤</p>
        <p>订正了大附魔【天堑奇珵·伤·腕】/【天堑奇珵·伤·鞋】伤害数值为145300、96900</p>
        <p>伤害类型改为真实伤害</p>
        <p>修正了极个别情况下【会心】【会心效果】突破上限的问题</p>
        <p>修正了极个别情况下【会心】【会心效果】突破上限的问题</p>
      </p>,
      '代码重构',
      <p key='3.1.2_雾海寻龙_代码重构' style={{ paddingLeft: 12 }}>
        <p>重构了伤害计算算法</p>
        <p>郭氏伤害取整顺序改为 计算顺序 伤害增加，破防，会效，等级减伤，无双，非侠，易伤</p>
        <p>理论计算结果更精确，重构后计算效率提升约30%</p>
        <p>对伤害计算公式进行了Tag标记，默认进行全部计算，真实伤害只吃秋肃和等级减伤</p>
        <p>代码里没做细分，偷懒这里就不区分戒火了。游戏内实际不吃戒火</p>
      </p>,
    ],
  },
  {
    version: '3.1.1_雾海寻龙',
    date: '2024-04-28 17:00:00',
    content: [
      '功能修复：',
      <p key='3.1.1_雾海寻龙_橙武' style={{ color: 'red' }}>
        经多人反馈后，现在选择CW不会默认启用CW循环。你需要手动选择CW循环。
      </p>,
      '橙武循环不再默认隐藏,可单独选择.目前内置的橙武循环为丛大压缩循环。不满意可以模拟器内自定义',
      '装备的【智能对比】功能中。CW后面的dps数字改为基于当前循环计算，而非自动替换为CW后计算的dps',
      '数据订正：（数据订正为计算器内用于计算的数据值修改，不是指游戏内削弱了）',
      <p key='3.1.1_雾海寻龙_数据订正' style={{ marginBottom: 8 }}>
        <p>【涤瑕】计算方式订正，修改为直接增加技能系数</p>
        <p>【孤锋破浪】</p>
        <p style={{ paddingLeft: 12 }}>- 大橙武 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p style={{ paddingLeft: 12 }}>- 门派套装 系数订正 0.1 {`=>`} 0.099609375</p>
        <p>【沧浪三叠】</p>
        <p style={{ paddingLeft: 12 }}>- 大橙武 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍3%伤害 系数订正 0.03 {`=>`} 0.0302734375</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【触石雨】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍3%伤害 系数订正 0.03 {`=>`} 0.0302734375</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p>【断云势】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【横云断浪】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【决云势】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍3%伤害 系数订正 0.03 {`=>`} 0.0302734375</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p>【留客雨】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍3%伤害 系数订正 0.03 {`=>`} 0.0302734375</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【停云势】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【行云势】</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍3%伤害 系数订正 0.03 {`=>`} 0.0302734375</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍4%伤害 系数订正 0.04 {`=>`} 0.0400390625</p>
        <p style={{ paddingLeft: 12 }}>- 秘籍5%伤害 系数订正 0.05 {`=>`} 0.0498046875</p>
        <p>【万灵阵】6%增伤订正 系数订正 0.0595703125 {`=>`} 0.060546875</p>
        <p>【刀宗阵】5%基础攻击 系数订正 0.0498046875 {`=>`} 0.048828125</p>
        <p>【鲸鱼阵】20%破防 系数订正 0.19921875 {`=>`} 0.2001953125</p>
        <p>【鲸鱼阵】20%破防 系数订正 0.19921875 {`=>`} 0.2001953125</p>
        <p>【天策阵】5阵眼覆盖率 系数订正 40% {`=>`} 50%</p>
        <p>【剑纯阵】15%会心效果 系数订正 0.150390625 {`=>`} 0.146484375</p>
        <p>【藏剑阵】3%身法 系数订正 0.0302734375 {`=>`} 0.029296875</p>
        <p>【苍云阵】5阵10%会心效果 系数订正 0.099609375 {`=>`} 0.09765625</p>
      </p>,
    ],
  },
  {
    // 正式服完整日志
    version: '3.1.0_雾海寻龙',
    date: '2024-04-25 09:00:00',
    content: [
      '【雾海寻龙】正式服完整更新日志',
      '技改相关',
      <p key='3.1.0_雾海寻龙_技改' style={{ paddingLeft: 12, marginBottom: 8 }}>
        <p>对非侠士目标造成的伤害加成由9%调整为6%。</p>
        <p>【避实击虚】造成伤害降低10%</p>
        <p>【溃延】“身形”存在时间延长6秒，触碰“身形”时降低10秒“决云势”调息时间</p>
        <p>【界破】伤害提高10%。</p>
        <p>【涣衍】“横云断浪”调息时间降低2秒，</p>
        <p>【流岚】“游风飘踪”调息时间提高10秒。</p>
        <p>
          【潋风】水墨圈改为4.5秒。回复锐意改为10点。断云势触发改为潋风携刃。潋风携刃伤害提高25%
        </p>
      </p>,
      '新赛季数值相关',
      <p key='3.1.0_雾海寻龙_数值' style={{ paddingLeft: 12, marginBottom: 8 }}>
        <p>装备库、小吃小药数值更新</p>
        <p>蓬莱阵(13%基础攻击)、凌雪阵(覆盖率)数值更新</p>
      </p>,
      '其余更新功能:',
      <p key='3.1.0_雾海寻龙_其他功能' style={{ paddingLeft: 12 }}>
        <p>【新循环】根据模拟器重新生成了循环</p>
        <p>【多方案系统】可以在保存装备、循环、增益信息至方案。快捷切换对比</p>
        <p>
          【配装器内面板显示】配装器内增加了当前装备的面板显示，同时展示和原装备对比属性变化情况
        </p>
        <p>【快速设置附魔】根据当前增益/循环等信息快速配置最佳附魔</p>
        <p>【快速设置五彩石】根据当前增益/循环等信息快速配置最佳五彩石</p>
        <p>【团队增益显示优化】为兼容后续更多的增益，优化了团队增益显示。修改增益移动到弹窗内。</p>
        <p>
          【橙武循环】当配装包含大橙武时，选择系统默认循环会自动切换为内置橙武循环，选择自定义循环则不会。
        </p>
      </p>,
    ],
  },
  {
    version: '3.0.12_体服',
    date: '2024-04-22 10:00:00',
    content: [
      <p key='3.0.12_1'>新增新赛季装备库（暂定，按照惯例正式服还会变一次）</p>,
      <p key='3.0.12_2'>新增属性“全能”，1点全能等于1点破招+1点无双+1点化劲</p>,
      <p key='3.0.12_3'>大附魔、小药等数据还没拿到新版本的值，没有更新</p>,
    ],
  },
  {
    version: '3.0.11_体服',
    date: '2024-04-17 10:30:00',
    content: [
      <p key='3.0.11_1'>修改蓬莱阵眼第二重增益为：基础攻击提高【15%】</p>,
      <p key='3.0.11_2'>修改凌雪阵第五重覆盖率为：55%</p>,
      <p key='3.0.11_3'>订正优化CW一段和二段加速计算循环</p>,
    ],
  },
  {
    version: '3.0.10_体服',
    date: '2024-04-07 14:00:00',
    content: [
      <p key='3.0.10_1'>新增了悟切换开关，暂无循环和技能系数</p>,
      <p key='3.0.10_2'>为兼容后续更多增益，优化了团队增益显示。修改增益移动到弹窗内。</p>,
      <p key='3.0.10_3'>大量代码逻辑优化</p>,
    ],
  },
  {
    version: '3.0.9_体服',
    date: '2024-04-03 09:45:00',
    content: [
      <p key='3.0.9_1'>
        体肤更新三改
        <a href='https://jx3.xoyo.com/announce/gg.html?id=1333643' target='_blank' rel='noreferrer'>
          技改链接
        </a>
      </p>,
      <p key='3.0.9_3' style={{ paddingLeft: 12 }}>
        {`- 对非侠士造成的伤害加成由【9%】降低至【6%】`}
      </p>,
      <p key='3.0.9_4' style={{ paddingLeft: 12 }}>
        {`-【避实击虚】造成的伤害降低10%`}
      </p>,
    ],
  },
  {
    version: '3.0.8_体服',
    date: '2024-03-28 12:00:00',
    content: [
      '更新了多方案系统，可以在保存装备、循环、增益信息至方案。快捷切换对比',
      '配装器内增加了当前装备的面板显示，同时展示和原装备对比属性变化情况',
    ],
  },
  {
    version: '3.0.7_体服',
    date: '2024-03-019 18:00:00',
    content: [
      <p key='3.0.7_1'>
        体肤更新二改
        <a
          href='https://jx3.xoyo.com/index/#/article-details?catid=2466&id=6158'
          target='_blank'
          rel='noreferrer'
        >
          技改链接
        </a>
      </p>,
      <p key='3.0.7_3' style={{ paddingLeft: 12 }}>
        {`-【涣衍】新增横云断浪调息时间降低【2】秒`}
      </p>,
      <p key='3.0.7_4' style={{ paddingLeft: 12 }}>
        {`-【流岚】调息时间提高【12秒】=>【10】秒`}
      </p>,
      <p key='3.0.7_5' style={{ paddingLeft: 12 }}>
        {`-【潋风】持续时间【4秒】=>【4.5秒】`}
      </p>,
      <p key='3.0.7_6' style={{ paddingLeft: 12 }}>
        {`-【溃延】身形持续时间延长【5 秒】=>【6 秒】、触碰降低【决云势】调息时间【13 秒】=>【10 秒】`}
      </p>,
      <p key='3.0.7_7'>{'以上改动模拟器已更新，可以使用模拟器模拟新循环'}</p>,
      <p key='3.0.7_8' style={{ color: 'red' }}>
        {'体服版本只会在国外源计算器更新'}
      </p>,
    ],
  },
  {
    version: '3.0.6_体服',
    date: '2024-03-06 09:30:00',
    content: ['更新体服循环'],
  },
  {
    version: '3.0.5_体服',
    date: '2024-03-04 20:40:00',
    content: [
      '更新改动潋风断进双刀回返还10锐，不知道是bug还是机制',
      '但是类似的连亘一个赛季也没修复',
    ],
  },
  {
    version: '3.0.4_体服',
    date: '2024-03-04 20:40:00',
    content: [
      <p key='3.0.4_1'>
        体肤更新一改
        <a
          href='https://jx3.xoyo.com/index/#/article-details?catid=2458&id=6120'
          target='_blank'
          rel='noreferrer'
        >
          技改链接
        </a>
      </p>,
      <p key='3.0.4_2' style={{ paddingLeft: 12 }}>
        {`- 潋风时间 【6】=> 【4】，删除拓锋，潋风携刃伤害增强25%`}
      </p>,
      <p key='3.0.4_3' style={{ paddingLeft: 12 }}>
        {`- 界破伤害增强10%`}
      </p>,
      <p key='3.0.4_4' style={{ paddingLeft: 12 }}>
        {'- 以上改动模拟器已更新，可以使用模拟器模拟新循环'}
      </p>,
      <p key='3.0.4_4' style={{ paddingLeft: 12, color: 'red' }}>
        {'体服版本只会在国外源计算器更新'}
      </p>,
    ],
  },
  {
    version: '3.0.3',
    date: '2024-02-27 18:40:00',
    content: ['其他更新：', '更新了默认的CW循环'],
  },
  {
    version: '3.0.2',
    date: '2024-02-27 16:00:00',
    content: [
      '模拟器更新：',
      '快速导入加入无影刀连亘循环（只支持234段加速）',
      '新增奇穴支持：滔天、横断、敛摄、截辕',
      '新增有CD技能可释放技能的层数显示',
      '重构流岚的作用逻辑，从开启奇穴全局生效改为区分作用到具体技能上',
      '其他更新：',
      '根据模拟器重新生成各循环技能数据',
    ],
  },
  {
    version: '3.0.1',
    date: '2024-02-26 12:00:00',
    content: [
      '2月26日技改：',
      '【镇机】每层破绽伤害加成降低至13%',
      '其他更新：',
      '新增无影刀循环（只支持234段加速）',
      '新增常规四破循环',
      '新增常规六破循环',
      '所有循环均为0帧模拟',
    ],
  },
  {
    version: '3.0.0',
    date: '2024-02-23 16:36:00',
    content: [
      '重点更新事项',
      <p key='3.0.0_模拟器' style={{ paddingLeft: 12 }}>
        - 拖更很久的模拟器终于开发完了：
        <a href='https://www.jx3box.com/tool/75292' target='_blank' rel='noreferrer'>
          使用手册
        </a>
      </p>,
      <p key='3.0.0_移除延迟' style={{ paddingLeft: 12 }}>
        - 移除了延迟这个计算条件
      </p>,
      <p key='3.0.0_重新选择循环' style={{ paddingLeft: 12 }}>
        - 修改了内置的循环为【快速四破】和【快速六破】
        <p style={{ color: 'orange' }}>- 使用前请重新选择循环</p>
      </p>,
      'CW玩家请注意:',
      <p key='3.0.0_CW提醒' style={{ paddingLeft: 12 }}>
        <p>- 现在在紫武和CW间切换不会自动变更循环，需要到外面手动修改选择你保存的自定义CW循环。</p>
        <p>- 默认的四破和六破CW循环数据后续更新，到时候默认循环就可以自动切换了</p>
      </p>,
    ],
  },
  {
    version: '2.2.4',
    date: '2024-01-26 09:15:00',
    content: ['现在你有小概率看到背景图是咸鱼'],
  },
  {
    version: '2.2.3',
    date: '2024-01-15 11:30:00',
    content: ['更新全新小CW【渊鸣】'],
  },
  {
    version: '2.2.2',
    date: '2023-12-29 09:10:00',
    content: ['新增装备龙门飞剑武器（剑风数量乱写的）'],
  },
  {
    version: '3.1.0',
    date: '2023-12-22 10:30:00',
    content: ['更新冬至相关装备', '更新创意料理', '优化小吃小药显示，增加智能对比'],
  },
  {
    version: '2.2.0',
    date: '2023-12-11 12:20:00',
    content: [
      '12月11日技改更新：',
      '非侠伤害 10% => 9%',
      '孤锋破浪 伤害增加10%',
      '界破 伤害增加10%',
      '紫武dps提升约为0.5%',
      '技改后CW循环还未更新，会尽快更新',
      '功能更新：',
      '新增装备智能对比dps功能',
      '系统更新：',
      '优化全局dps算法，dps计算效率提升20%',
      '优化收益显示，以攻击力为1对比（只影响显示，不影响原收益高低情况）',
    ],
  },
  {
    version: '2.1.4',
    date: '2023-12-07 17:30:00',
    content: ['更新增益劲风破风的数值为1397（奇穴描述是33%实际并不是）'],
  },
  {
    version: '2.1.3',
    content: ['更新阵眼计算无双相关的计算错误。感谢霸刀考拉大佬的捉虫'],
  },
  {
    version: '2.1.2',
    content: ['增加了阵眼收益动态显示，基于当前属性动态计算，按从高到底排序'],
  },
  {
    version: '2.1.0',
    content: [
      '万灵当歌版本技改，大量循环变动',
      '增加奇穴切换功能',
      '将强膂移动至奇穴切换功能',
      '增加万灵阵',
      '修改刀宗非侠系数6%=>10%',
      '由于奇穴和循环的变动，在开始使用前需要重新依次检查配装器、循环、奇穴配置以保证你的数据准确',
      '增加了一个属性优化算法，详情见描述（beta）',
    ],
  },
  {
    version: '2.0.5',
    content: [
      '修复了大橙武对孤锋破浪的5%伤害加成未生效问题',
      '重构了dps计算部分的代码逻辑，使其计算流程更加合理',
      '由于本次对部分装备增益的变量名称有修改，看到版本更新后请重新打开配装器，点击保存并计算刷新配装',
    ],
  },
  {
    version: '2.0.4',
    content: [
      '修复了力道加成破防在计算最终dps时的系数偏差',
      '该偏差使最终dps数字比实际略低一千左右，（不影响收益显示）',
    ],
  },
  {
    version: '2.0.3',
    content: [
      '7月31日技改更新',
      '刀宗喜提非侠6%',
      '孤锋破浪技能伤害调整：降低10%',
      '橙武增强 ≈ 3%',
      '周流增强 ≈ 3.5%',
      '驭耀增强 ≈ 4%',
    ],
  },
  {
    version: '2.0.2',
    content: ['6月19日技改更新', '断云势伤害降低10%'],
  },
  {
    version: '2.0.1',
    content: [
      '5月15日技改更新',
      '流岚无视防御35% => 40%',
      '横云断浪伤害降低20%',
      '截辕伤害和截辕DOT伤害降低25%',
      '系数为公告描述系数，实际更新后根据实测数值调整',
      '修复了11150破破暗器和12450暗器名称错误的问题',
      '总结：dps基本没变化',
    ],
  },
  {
    version: '2.0.0',
    content: [
      '循环内镇机改为界破',
      '优化了循环类型，目前只有驭耀和周流两个选项',
      '配装器选择CW且循环为周流时自动启用CW循环',
      '修改驭耀循环的战斗计算时间',
      '修改孤锋断浪系数（-15%）',
      '修改梅花三弄增益计算（默认80层）',
      '修改左旋右转增益计算（默认80层）',
      '新增本赛季副本、试炼装备',
      '新增本赛季紫色附魔',
      '增加最优推荐功能（娱乐功能，持续完善中）',
      '增加了开启/关闭背景功能',
      '大CW循环待定',
    ],
  },
  {
    version: '1.2.4',
    content: ['新增暗器“择逸录·扶”'],
  },
  {
    version: '1.2.3',
    content: ['修复了由于装备ID相同导致选择10900无封项链（会招）时，异常携带龙门武器特效的问题'],
  },
  {
    version: '1.2.2',
    content: ['新增龙门特效武器四绝分海刀'],
  },
  {
    version: '1.2.1',
    content: [
      '新增冬至装备岚峰·刀功系列',
      '增益新增冬至武器特效“吟冬卧雪”',
      '移动配装器“启用强膂”选项的位置',
    ],
  },
  {
    version: '1.2.0',
    content: [
      '12月12日技改后更新',
      '重新调整所有循环。(计算前请重新选择循环！！！)',
      '暂时删除周纵循环（如果还有救等待优化后恢复）',
      '删除周流141横等循环，后续周流只留一个循环作为参考',
    ],
  },
  {
    version: '1.1.9',
    content: ['调整决云势技能伤害系数：0.40625 => 1.175'],
  },
  {
    version: '1.1.8',
    content: ['为避免首次使用者误解，增益弹窗改为默认展开。（依然可以手动关闭）'],
  },
  {
    version: '1.1.7',
    content: ['调整孤锋破浪技能伤害系数（降低10%）'],
  },
  {
    version: '1.1.6',
    content: ['删除菜周', '增加周纵1.0循环', '修复CW循环计算截辕伤害异常的问题'],
  },
  {
    version: '1.1.5',
    content: ['隐藏了属性录入功能', '内置配装器内新增魔盒配装方案导入功能，敬请体验'],
  },
  {
    version: '1.1.4',
    content: [
      '配装器戒指增加橙戒',
      '删除驭耀3.0',
      '增加大CW特效行云势·神兵',
      '新增娱乐CW循环（风雪哥哥提供）',
    ],
  },
  {
    version: '1.1.3',
    content: [
      '更新了大附魔',
      '注：伤衣、伤帽数值目前按普通大附魔数值计算的，和10人大附魔实际dps差距很小。',
      '注：伤腕、伤鞋大附魔系数待实测，切勿根据此2大附魔调整配装',
    ],
  },
  {
    version: '1.1.2',
    content: [
      '配装器内增加了装备推荐，个人想法仅供参考',
      '切换装备推荐没有切换循环，切勿直接对比驭耀和周流的dps差异',
    ],
  },
  {
    version: '1.1.1',
    content: [
      '更新左旋右转的默认覆盖率为90% => 100%',
      '更新左旋右转的破招增加数值为 1800 => 4500',
      '更新秋肃的增伤5% => 6%',
      '更新仙王蛊鼎的增伤8% => 12%',
      '6750品小CW新增“沧浪三叠5%会心”增益',
      '大CW新增“沧浪三叠5%伤害”、“孤锋破浪5%伤害"增益',
      '新增清除缓存选项，计算器异常时可以尝试尝试缓存',
    ],
  },
  {
    version: '1.1.0',
    content: [
      '本版本调整后对收益有巨大影响，之前计算方式有问题，感谢七海大佬、平泽唯大佬的捉虫。学艺不精计算失误非常抱歉',
      '调整了增益的计算，把同类增益合并到一起计算而不是相乘',
      '删除了实战基本无法吃到的配伍增益',
    ],
  },
  {
    version: '1.0.8',
    content: [
      '优化了增益的计算方式，改为通过不郭氏计算计算单点收益',
      '由于小药、附魔等数值比例不统一，增加多种查看选择',
      '优化了各种增益的计算顺序',
      '优化计算dps算法，使计算伤害算法更加合理',
    ],
  },
  {
    version: '1.0.7',
    content: ['更新了团队增益选项，新增：酒中仙、剑锋百锻、炽炎、疏狂、戒火斩、皎肃、乘龙箭、虚弱'],
  },
  {
    version: '1.0.6',
    content: [
      '循环新增了平民周流循环',
      '调整加速和网络延迟的影响',
      '目前二段加速循环需要更改，暂时只推荐一段加速配装',
      '暂时不推荐使用属性录入选项，后续会推出魔盒导入能力',
    ],
  },
  {
    version: '1.0.5',
    content: [
      '修复了25普通装备套装效果加成未计算的问题',
      '修复了25英雄套装效果默认计算的问题',
      '修复了切糕装备属性未计算的问题',
      '新增了食品增强、药品增强的加速小药',
      '修复家园加速酒数值异常的问题',
      '优化了配装器内的装备套装效果显示',
    ],
  },
  {
    version: '1.0.4',
    content: ['更新驭耀4.0循环', '更新周流3.0循环', '增加延迟/加速计算'],
  },
  {
    version: '1.0.3',
    content: ['更新正式服流岚计算', '更新临时驭耀假想循环（由777大佬提供）'],
  },
  {
    version: '1.0.2',
    content: ['更新周流循环', '配装器内新增dps对比能力'],
  },
  {
    version: '1.0.1',
    content: ['更新装备属性、名称', '添加绝地天通刀(无特效)'],
  },
  {
    version: '1.0.0',
    content: ['发布1.0正式版', '更新团队增益、小吃等'],
  },
  {
    version: '0.0.7',
    content: [
      '修改了孤锋破浪的武器伤害系数100% => 250%',
      '更新溃延循环计算（默认打完循环4分52秒）',
      '更新体服最新附魔，更新了计算收益时的附魔数值',
    ],
  },
  {
    version: '0.0.6',
    content: '更新流岚计算，默认内置了流岚和2件套的加成',
  },
  {
    version: '0.0.5',
    content: '放开增益选项，开放阵眼选择能力',
  },
  {
    version: '0.0.4',
    content: ['优化了镶嵌五行石选项、五彩石的颜色，使其更易分别', '更新所有技能会心秘籍的计算算法'],
  },
  {
    version: '0.0.3',
    content: '新增内置配装器，帮助更快设置自身属性',
  },
  {
    version: '0.0.2',
    content: '计算器UI改版，布局样式参考了各门派计算器',
  },
  {
    version: '0.0.1',
    content: '初始化计算器',
  },
]
