// import 循环主类 from '../main'
import 循环模拟技能基础数据 from '../../../constant/skill'
import 有CD技能通用类 from '../../通用类/有CD技能通用类'

class 停云势 extends 有CD技能通用类 {
  static 技能数据 = 循环模拟技能基础数据?.find((item) => item.技能名称 === '停')
  static 回复锐意 = 0

  constructor(模拟循环) {
    super(模拟循环)

    停云势.回复锐意 =
      (停云势.技能数据?.回复锐意 || 0) + (this.模拟循环.校验奇穴是否存在?.('驭耀') ? 10 : 0)

    this.初始化技能运行数据(停云势.技能数据)
  }

  命中() {
    // 横断：停云势”“留客雨”会刷新目标身上属于自身的“横云断浪”流血效果。
    if (
      this.模拟循环.当前自身buff列表?.['流血']?.当前层数 &&
      this.模拟循环.校验奇穴是否存在?.('横断')
    ) {
      this.模拟循环.添加buff?.({ 名称: '流血', 对象: '目标', 新增层数: 0 })
    }
  }

  造成伤害() {
    this.模拟循环.触发潋风携刃?.()

    this.模拟循环.触发避实击虚?.()

    this.触发伤害行为('停云势')
  }

  释放后() {
    this.流云势法触发连亘()

    this.触发回复锐意(停云势.回复锐意, 停云势.技能数据?.技能名称)

    this.保存释放记录()

    // 去除雨积
    if (this.模拟循环.当前自身buff列表?.['雨积']?.当前层数) {
      this.模拟循环.卸除buff?.({ 名称: '雨积', 对象: '自身' })
    }
  }

  保存释放记录() {
    this.本次释放记录 = {
      重要buff列表: this.获取当前重要buff列表(['雨积', '灭影追风', '潋风', '流岚']),
    }
  }
}

export default 停云势

export const 停云势类型 = typeof 停云势
