// 技能增伤类型
export enum GainDpsTypeEnum {
  A = 'a',
  B = 'b',
  C = 'c',
}

// 增益类型
export enum GainTypeEnum {
  力道 = '力道',
  基础攻击 = '基础攻击',
  近战武器伤害 = '近战武器伤害',
  外攻会心等级 = '外攻会心等级',
  外攻会心百分比 = '外攻会心百分比',
  外攻会心效果等级 = '外攻会心效果等级',
  外攻会心效果百分比 = '外攻会心效果百分比',
  外攻破防等级 = '外攻破防等级',
  外攻破防百分比 = '破防百分比',
  无双等级 = '无双等级',
  无视防御 = '无视防御',
  伤害 = '伤害',
  伤害百分比 = '伤害百分比',
  破招 = '破招',
  破招百分比 = '破招百分比',
  体质 = '体质',
  加速 = '加速',
}

// 技能增伤类型
export enum EquipmentInlayEnum {
  力道 = '力道',
  攻击 = '攻击',
  破招 = '破招',
  会心 = '会心',
  会效 = '会效',
  破防 = '破防',
  无双 = '无双',
  加速 = '加速',
}

export enum EquipmentTypeEnum {
  普通 = '普通',
  副本精简 = '副本精简',
  切糕 = '切糕',
  门派套装 = '门派套装',
  试炼精简 = '试炼精简',
  特效武器 = '特效武器',
  小CW = '小CW',
  大CW = '大CW',
}
