import { MijiSelectedData } from '@/@types/miji'

export const DEFAULT_CHARACTER = {
  面板攻击: 0,
  破防值: 0,
  无双值: 0,
  会心值: 0,
  会心效果值: 0,
  武器伤害_最小值: 0,
  武器伤害_最大值: 0,
  破招值: 0,
}

export const ZENGYI_DATA_DEFAULT = {
  阵眼: '',
}

export const DEFAULT_EQUIPMENT = JSON.parse(
  `{"wucaishi":"彩·真刚·锐刃·狂攻(陆)","openQiangLv":1,"equipments":[{"镶嵌孔数组":[{"镶嵌类型":"力道","镶嵌宝石等级":8},{"镶嵌类型":"破防","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90665,"装备部位":"帽子","附魔":"加速+491"},{"镶嵌孔数组":[{"镶嵌类型":"力道","镶嵌宝石等级":8},{"镶嵌类型":"会心","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90563,"装备部位":"衣服"},{"镶嵌孔数组":[{"镶嵌类型":"无双","镶嵌宝石等级":8},{"镶嵌类型":"会心","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90611,"装备部位":"腰带"},{"镶嵌孔数组":[{"镶嵌类型":"无双","镶嵌宝石等级":8},{"镶嵌类型":"力道","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90641,"装备部位":"护腕","附魔":"力道+110"},{"镶嵌孔数组":[{"镶嵌类型":"攻击","镶嵌宝石等级":8},{"镶嵌类型":"会心","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90551,"装备部位":"下装","附魔":"力道+110"},{"镶嵌孔数组":[{"镶嵌类型":"力道","镶嵌宝石等级":8},{"镶嵌类型":"无双","镶嵌宝石等级":8}],"当前精炼等级":6,"id":90545,"装备部位":"鞋子","附魔":"攻击+221"},{"镶嵌孔数组":[{"镶嵌类型":"破防","镶嵌宝石等级":8}],"当前精炼等级":6,"id":34243,"装备部位":"项链"},{"镶嵌孔数组":[{"镶嵌类型":"破防","镶嵌宝石等级":8}],"当前精炼等级":6,"id":34249,"装备部位":"腰坠"},{"镶嵌孔数组":[],"当前精炼等级":6,"id":34273,"装备部位":"戒指","附魔":"力道+110"},{"镶嵌孔数组":[],"当前精炼等级":6,"id":34273,"装备部位":"戒指","附魔":"力道+110"},{"镶嵌孔数组":[{"镶嵌类型":"攻击","镶嵌宝石等级":8}],"当前精炼等级":6,"id":32660,"装备部位":"暗器","附魔":"力道+110"},{"镶嵌孔数组":[{"镶嵌类型":"攻击","镶嵌宝石等级":8},{"镶嵌类型":"力道","镶嵌宝石等级":8},{"镶嵌类型":"破防","镶嵌宝石等级":8}],"当前精炼等级":6,"id":32585,"装备部位":"武器","附魔":"武伤+332"}]}`
)

export const DEFAULT_MIJI_SELECTED_DATA: MijiSelectedData[] = [
  {
    技能名称: '行云势',
    技能已选秘籍: ['3%伤害', '4%伤害', '5%伤害', '4%会心'],
  },
  {
    技能名称: '停云势',
    技能已选秘籍: ['3%伤害', '4%伤害', '3%会心', '4%会心'],
  },
  {
    技能名称: '留客雨',
    技能已选秘籍: ['3%伤害', '4%伤害', '5%伤害', '4%会心'],
  },
  {
    技能名称: '决云势',
    技能已选秘籍: ['3%伤害', '4%伤害', '3%会心', '2%会心'],
  },
  {
    技能名称: '断云势',
    技能已选秘籍: ['4%伤害', '5%伤害', '3%会心', '4%会心'],
  },
  {
    技能名称: '沧浪三叠',
    技能已选秘籍: ['3%伤害', '4%伤害', '5%伤害', '4%会心'],
  },
  {
    技能名称: '横云断浪',
    技能已选秘籍: ['4%伤害', '5%伤害', '3%会心', '4%会心'],
  },
  {
    技能名称: '孤锋破浪',
    技能已选秘籍: ['4%伤害', '5%伤害', '3%会心', '4%会心'],
  },
  {
    技能名称: '触石雨',
    技能已选秘籍: ['4%伤害', '5%伤害', '4%会心', '5%会心'],
  },
]
