// 官方颜色，太丑了
// export const DOMAIN_COLOR = '#a69565'

// 自己瞎搞的颜色
export const DOMAIN_COLOR = '#365E9F'

export const 当前门派缓存前缀 = '刀宗'

// 用于保存在浏览器的各属性键值
export const 缓存映射 = {
  当前方案名称: `${当前门派缓存前缀}_当前方案名称`,
  全部方案数据: `${当前门派缓存前缀}_全部方案数据`,
  // 方案配套
  角色基础属性: `${当前门派缓存前缀}_角色基础属性`,
  装备信息: `${当前门派缓存前缀}_装备信息`,
  增益启用: `${当前门派缓存前缀}_增益启用`,
  增益数据: `${当前门派缓存前缀}_增益数据`,
  当前奇穴信息: `${当前门派缓存前缀}_当前奇穴信息`,
  当前循环名称: `${当前门派缓存前缀}_当前循环名称`,
  // 其他缓存
  当前输出计算目标名称: `${当前门派缓存前缀}_当前输出计算目标名称`,
  网络延迟: `${当前门派缓存前缀}_网络延迟`,
  关闭背景图: `${当前门派缓存前缀}_关闭背景图`,
  当前秘籍信息: `${当前门派缓存前缀}_当前秘籍信息`,
  自定义循环: `${当前门派缓存前缀}_自定义循环`,
  日志版本: `${当前门派缓存前缀}_日志版本`,
  使用说明: `${当前门派缓存前缀}_使用说明`,
}
