// import 溢出 from './快速导入默认循环/启用循环/溢出'
// import 油门 from './快速导入默认循环/启用循环/油门'
import 油门 from './快速导入默认循环/启用循环/油门'
import 油门一键宏 from './快速导入默认循环/启用循环/油门一键宏'
import DMI from './快速导入默认循环/启用循环/DMI'
import 无影刀 from './快速导入默认循环/启用循环/无影刀'
import 橙武_一段加速 from './快速导入默认循环/启用循环/橙武_一段加速'
import 橙武_二段加速 from './快速导入默认循环/启用循环/橙武_二段加速'

export default [
  // 溢出,
  DMI,
  油门,
  油门一键宏,
  无影刀,
  橙武_一段加速,
  橙武_二段加速,
  // 常规四破,
  // 常规六破,
  // 快速四破,
  // 快速六破,
  // CW循环,
  // 无影刀,
  // 无影刀连亘,
  // 体服一段加速六破循环,
  // 体服二段加速六破溢出循环,
  // 体服二段加速踩油门循环,
  // 体服威声循环,
]
