import { CycleDTO } from '../../@types/cycle'

const weisheng_cang34_cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 136,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '截辕',
    技能数量: 90,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 200 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 400,
    技能增益列表: [
      { 增益名称: '斩颓·破绽一', 增益技能数: 6 },
      { 增益名称: '灭影随风,斩颓·破绽一', 增益技能数: 7 },
      { 增益名称: '斩颓·破绽二', 增益技能数: 12 },
      { 增益名称: '灭影随风,斩颓·破绽一', 增益技能数: 5 },
      { 增益名称: '斩颓·破绽三', 增益技能数: 14 },
      { 增益名称: '斩颓·破绽四', 增益技能数: 11 },
      { 增益名称: '灭影随风', 增益技能数: 100 },
    ],
  },
  {
    技能名称: '行云势·一',
    技能数量: 25,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 4 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 20,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 2 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 15,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 2 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 31,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 18 }],
  },
  {
    技能名称: '停云势',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 30 }],
  },
  {
    技能名称: '决云势',
    技能数量: 21,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 5 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 10,
  },
  {
    技能名称: '触石雨',
    技能数量: 10,
  },
  {
    技能名称: '断云势',
    技能数量: 15,
    技能增益列表: [
      { 增益名称: '镇机·破绽二', 增益技能数: 1 },
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 13 },
    ],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 15,
    技能增益列表: [
      { 增益名称: '镇机·破绽二', 增益技能数: 1 },
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 13 },
    ],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 45,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 10,
  },
  {
    技能名称: '流血·三',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 27,
  },
  {
    技能名称: '横刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
]

export default weisheng_cang34_cycle
