import yuyao from './yuyao'
import zhouliu_zhenji from './zhouliu_zhenji'
import zhouliu_jiepo from './zhouliu_jiepo'
import zhouliu_cw_fx from './zhouliu_cw_fx'

const All_Cycle_Data = [
  {
    name: '驭耀',
    cycle: yuyao,
    cycleList: [
      { 计算技能数: 10, 循环完整帧数: 242, 循环次数: 1 },
      { 计算技能数: 15, 循环完整帧数: 300, 循环次数: 14 },
    ],
    type: '驭耀',
  },
  {
    name: '周流镇机',
    cycle: zhouliu_zhenji,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 166, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 190, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 230, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: '周流界破',
    cycle: zhouliu_jiepo,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 166, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 190, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 230, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: 'CW周流',
    cycle: zhouliu_cw_fx,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 92, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 166, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 190, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 230, 循环次数: 6 },
    ],
  },
]

export default All_Cycle_Data
