import yuyao_3 from './yuyao_3'
import yuyao from './yuyao'
import zhouliu_130 from './zhouliu_130'
import zhouliu_137 from './zhouliu_137'
import zhouliu_141 from './zhouliu_141'
import zhouliu_141_heng from './zhouliu_141_heng'
import zhouliu_145 from './zhouliu_145'
// import zhouliu_cw_ou from './zhouliu_cw_ou'

const All_Cycle_Data = [
  {
    name: '驭耀3.0',
    cycle: yuyao_3,
    cycleList: [
      { 计算技能数: 12, 循环完整帧数: 296, 循环次数: 1 },
      { 计算技能数: 14, 循环完整帧数: 312, 循环次数: 14 },
    ],
    type: '驭耀',
  },
  {
    name: '驭耀4.0',
    cycle: yuyao,
    cycleList: [
      { 计算技能数: 9, 循环完整帧数: 224, 循环次数: 1 },
      { 计算技能数: 14, 循环完整帧数: 312, 循环次数: 14 },
    ],
    type: '驭耀',
  },
  {
    name: '菜周（133）',
    cycle: zhouliu_130,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: '练习周流（137）',
    cycle: zhouliu_137,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: '周流入门（141）',
    cycle: zhouliu_141,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: '周流高手（141打横）',
    cycle: zhouliu_141_heng,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
    ],
    type: '周流',
  },
  {
    name: '周流萌新（145）',
    cycle: zhouliu_145,
    cycleList: [
      { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
      { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
      { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
      { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
      { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
      { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
      { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
    ],
    type: '周流',
  },
  // {
  //   name: 'CW周流（欧皇）',
  //   cycle: zhouliu_cw_ou,
  //   cycleList: [
  //     { 计算技能数: 4, 循环完整帧数: 96, 循环次数: 5 },
  //     { 计算技能数: 5, 循环完整帧数: 104, 循环次数: 2 },
  //     { 计算技能数: 5, 循环完整帧数: 120, 循环次数: 2 },
  //     { 计算技能数: 6, 循环完整帧数: 128, 循环次数: 7 },
  //     { 计算技能数: 8, 循环完整帧数: 160, 循环次数: 6 },
  //     { 计算技能数: 8, 循环完整帧数: 184, 循环次数: 2 },
  //     { 计算技能数: 10, 循环完整帧数: 224, 循环次数: 6 },
  //   ],
  // },
]

export default All_Cycle_Data
