import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 48,
    技能增益列表: [
      { 增益名称: '灭影追风', 增益技能数: 20 },
      { 增益名称: '戗风', 增益技能数: 12 },
    ],
  },
  {
    技能名称: '破',
    技能数量: 48,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 20 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 553,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 350 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 31,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 14 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 31,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 12 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 132,
    技能增益列表: [
      { 增益名称: '灭影追风,雨积', 增益技能数: 77 },
      { 增益名称: '灭影追风', 增益技能数: 27 },
    ],
  },
  {
    技能名称: '留客雨',
    技能数量: 193,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 40 }],
  },
  {
    技能名称: '停云势',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '决云势',
    技能数量: 49,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 12 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 5,
  },
  {
    技能名称: '触石雨',
    技能数量: 12,
  },
  {
    技能名称: '断云势',
    技能数量: 48,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 12 }],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 48,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 12 }],
  },
  {
    技能名称: '云刀',
    技能数量: 210,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 120 }],
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 243,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 22 }],
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 48,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 12 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 24,
  },
  {
    技能名称: '流血·四',
    技能数量: 143,
  },
  {
    技能名称: '流血·三',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '戗风',
  '雨积',
  '放皓',
  '电逝',
  '击懈',
  '界破',
  '鸣锋',
  '涣衍',
  '连亘',
  '聚疏',
  '潋风',
]
