import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 129,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '破',
    技能数量: 129,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '界破',
    技能数量: 32,
    // 技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 500,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 140 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 15,
  },
  {
    技能名称: '行云势·二',
    技能数量: 15,
  },
  {
    技能名称: '行云势·三',
    技能数量: 120,
    技能增益列表: [{ 增益名称: '灭影随风,雨积', 增益技能数: 120 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 224,
  },
  {
    技能名称: '停云势',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '决云势',
    技能数量: 32,
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 7,
  },
  {
    技能名称: '触石雨',
    技能数量: 6,
  },
  {
    技能名称: '断云势',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 192,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 32,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 16 }],
  },
]

export default cycle
