import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 1,
  },
  {
    技能名称: '孤锋破浪',
    统计用技能名称: '孤锋破浪（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '破',
    技能数量: 1,
  },
  {
    技能名称: '破',
    统计用技能名称: '破（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 1,
  },
  {
    技能名称: '避实击虚',
    统计用技能名称: '避实击虚（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '沧浪三叠·一',
    统计用技能名称: '沧浪三叠·一（放皓）',
    技能数量: 1,
  },
  {
    技能名称: '沧浪三叠·一',
    统计用技能名称: '沧浪三叠·一（灭影放皓）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '沧浪三叠·二',
    统计用技能名称: '沧浪三叠·二（放皓）',
    技能数量: 1,
  },
  {
    技能名称: '沧浪三叠·二',
    统计用技能名称: '沧浪三叠·二（灭影放皓）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '沧浪三叠·三',
    统计用技能名称: '沧浪三叠·三（放皓）',
    技能数量: 1,
  },
  {
    技能名称: '沧浪三叠·三',
    统计用技能名称: '沧浪三叠·三（灭影放皓）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 1,
  },
  {
    技能名称: '行云势·一',
    统计用技能名称: '行云势·一（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·一',
    统计用技能名称: '行云势·一（雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·一',
    统计用技能名称: '行云势·一（灭影雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风,雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 1,
  },
  {
    技能名称: '行云势·二',
    统计用技能名称: '行云势·二（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·二',
    统计用技能名称: '行云势·二（雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·二',
    统计用技能名称: '行云势·二（灭影雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风,雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 1,
  },
  {
    技能名称: '行云势·三',
    统计用技能名称: '行云势·三（灭影）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·三',
    统计用技能名称: '行云势·三（雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·三',
    统计用技能名称: '行云势·三（灭影雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风,雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '行云势·神兵',
    技能数量: 1,
  },
  {
    技能名称: '留客雨',
    技能数量: 1,
  },
  {
    技能名称: '停云势',
    技能数量: 1,
  },
  {
    技能名称: '停云势',
    统计用技能名称: '停云势（雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '停云势',
    统计用技能名称: '停云势（灭影雨积）',
    技能数量: 1,
    技能增益列表: [{ 增益名称: '灭影追风,雨积', 增益技能数: 1 }],
  },
  {
    技能名称: '决云势',
    技能数量: 1,
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 1,
  },
  {
    技能名称: '触石雨',
    技能数量: 1,
  },
  {
    技能名称: '断云势',
    统计用技能名称: '断云势',
    技能数量: 1,
  },
  {
    技能名称: '断云势·额外伤害',
    统计用技能名称: '断云势·额外伤害',
    技能数量: 1,
  },
  {
    技能名称: '界破',
    技能数量: 1,
  },
  {
    技能名称: '云刀',
    技能数量: 1,
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 1,
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 1,
  },
  {
    技能名称: '横云断浪',
    技能数量: 1,
  },
  {
    技能名称: '流血·四',
    技能数量: 1,
  },
  {
    技能名称: '鸣锋',
    技能数量: 1,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '聚疏',
  '雨积',
  '放皓',
  '电逝',
  '击懈',
  '界破',
  '鸣锋',
  '涣衍',
  '连亘',
  '流岚',
  '潋风',
]
