import { CycleDTO } from '../../@types/cycle'

const weisheng_cang_cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 121,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '破',
    技能数量: 121,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '截辕',
    技能数量: 31,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 4 }],
  },
  {
    技能名称: '截辕（DOT）',
    技能数量: 144,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 0 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 420,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 200 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 28,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 3 }],
  },
  {
    技能名称: '行云势·二',
    技能数量: 17,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 3 }],
  },
  {
    技能名称: '行云势·三',
    技能数量: 23,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 4 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 45,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 20 }],
  },
  {
    技能名称: '停云势',
    技能数量: 24,
    技能增益列表: [{ 增益名称: '雨积', 增益技能数: 14 }],
  },
  {
    技能名称: '决云势',
    技能数量: 23,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 5 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 6,
  },
  {
    技能名称: '触石雨',
    技能数量: 8,
  },
  {
    技能名称: '断云势',
    技能数量: 15,
    技能增益列表: [
      { 增益名称: '镇机·破绽二', 增益技能数: 1 },
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 14 },
    ],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 15,
    技能增益列表: [
      { 增益名称: '镇机·破绽二', 增益技能数: 1 },
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 14 },
    ],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 30,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '横刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 15,
  },
  {
    技能名称: '流血·三',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 42,
  },
]

export default weisheng_cang_cycle
