import { CycleDTO } from '../../@types/cycle'

const weisheng_cang_cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 179,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '破',
    技能数量: 179,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '截辕',
    技能数量: 46,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '截辕（DOT）',
    技能数量: 156,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 45 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 400,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 130 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 18,
  },
  {
    技能名称: '停云势',
    技能数量: 4,
  },
  {
    技能名称: '决云势',
    技能数量: 29,
  },
  {
    技能名称: '凝神势·破锋',
    技能数量: 2,
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 7,
  },
  {
    技能名称: '断云势',
    技能数量: 20,
    技能增益列表: [
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 19 },
    ],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 20,
    技能增益列表: [
      { 增益名称: '镇机·破绽三', 增益技能数: 1 },
      { 增益名称: '镇机·破绽四', 增益技能数: 19 },
    ],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 45,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 45,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 42,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 15 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 60 }],
  },
  {
    技能名称: '横云断浪',
    技能数量: 8,
  },
  {
    技能名称: '流血·四',
    技能数量: 24,
  },
]

export default weisheng_cang_cycle
