import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 98,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 8 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 12 },
      { 增益名称: '戗风', 增益技能数: 8 },
    ],
  },
  {
    技能名称: '破',
    技能数量: 98,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 20 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 480,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 350 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 24,
  },
  {
    技能名称: '行云势·二',
    技能数量: 24,
  },
  {
    技能名称: '行云势·三',
    技能数量: 99,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 75 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 100,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
  {
    技能名称: '停云势',
    技能数量: 3,
  },
  {
    技能名称: '决云势',
    技能数量: 25,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 5,
  },
  {
    技能名称: '触石雨',
    技能数量: 12,
  },
  {
    技能名称: '断云势',
    技能数量: 25,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 25,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '云刀',
    技能数量: 200,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 120 }],
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 172,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 22 }],
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 15,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 24,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 24,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 24,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '横云断浪',
    技能数量: 25,
  },
  {
    技能名称: '流血·六',
    技能数量: 143,
  },
  {
    技能名称: '流血·五',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
  {
    技能名称: '流血·三',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
  {
    技能名称: '流血·四',
    技能数量: 3,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '戗风',
  '溃延',
  '放皓',
  '电逝',
  '承磊',
  '镇机',
  '长溯',
  '涣衍',
  '涤瑕',
  '流岚',
  '潋风',
]
