import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '孤锋破浪',
    技能数量: 95,
    技能增益列表: [
      { 增益名称: '灭影随风,戗风', 增益技能数: 38 },
      { 增益名称: '戗风', 增益技能数: 57 },
    ],
  },
  {
    技能名称: '破',
    技能数量: 96,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 38 }],
  },
  {
    技能名称: '避实击虚',
    技能数量: 500,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 250 }],
  },
  {
    技能名称: '行云势·一',
    技能数量: 21,
  },
  {
    技能名称: '行云势·二',
    技能数量: 21,
  },
  {
    技能名称: '行云势·三',
    技能数量: 114,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 94 }],
  },
  {
    技能名称: '留客雨',
    技能数量: 101,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
  {
    技能名称: '决云势',
    技能数量: 26,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '驰风八步·一',
    技能数量: 8,
  },
  {
    技能名称: '触石雨',
    技能数量: 10,
  },
  {
    技能名称: '断云势',
    技能数量: 26,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '断云势·额外伤害',
    技能数量: 26,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '云刀',
    技能数量: 210,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 120 }],
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 183,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 85 }],
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 26,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '沧浪三叠·一',
    技能数量: 23,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '沧浪三叠·二',
    技能数量: 23,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '沧浪三叠·三',
    技能数量: 23,
    技能增益列表: [
      { 增益名称: '灭影随风', 增益技能数: 6 },
      { 增益名称: '灭影随风,戗风', 增益技能数: 6 },
    ],
  },
  {
    技能名称: '横云断浪',
    技能数量: 24,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 12 }],
  },
  {
    技能名称: '流血·四',
    技能数量: 158,
    技能增益列表: [{ 增益名称: '灭影随风', 增益技能数: 80 }],
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '戗风',
  '溃延',
  '放皓',
  '电逝',
  '观衅',
  '界破',
  '长溯',
  '涣衍',
  '强膂',
  '流岚',
  '潋风',
]
