import { CycleDTO } from '../../@types/cycle'

const cycle: CycleDTO[] = [
  {
    技能名称: '避实击虚',
    技能数量: 12,
  },
  {
    技能名称: '行云势·三',
    技能数量: 6,
  },
  {
    技能名称: '留客雨',
    技能数量: 4,
  },
  {
    技能名称: '决云势',
    技能数量: 1,
  },
  {
    技能名称: '断云势',
    统计用技能名称: '断云势',
    技能数量: 1,
  },
  {
    技能名称: '断云势·额外伤害',
    统计用技能名称: '断云势·额外伤害',
    技能数量: 1,
  },
  {
    技能名称: '潋风·携刃',
    技能数量: 4,
  },
  {
    技能名称: '潋风·拓锋',
    技能数量: 1,
  },
]

export default cycle

export const 循环默认奇穴 = [
  '渊冲',
  '聚疏',
  '雨积',
  '放皓',
  '电逝',
  '击懈',
  '界破',
  '鸣锋',
  '涣衍',
  '连亘',
  '流岚',
  '潋风',
]
