import { Buff枚举, CycleSimulatorSkillDTO, 日志类型 } from '@/@types/cycleSimulator'

const 循环模拟技能基础数据: CycleSimulatorSkillDTO[] = [
  {
    技能名称: '行',
    技能释放后添加GCD: 24,
    回复锐意: 5,
    造成伤害次数: 1,
    技能CD: 0,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '停',
    技能释放后添加GCD: 24,
    回复锐意: 10,
    造成伤害次数: 1,
    技能CD: 16 * 12,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '决',
    技能释放后添加GCD: 24,
    回复锐意: 25,
    技能CD: 16 * 20,
    造成伤害次数: 1,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '决-识破',
    技能释放后添加GCD: 24,
    回复锐意: 35,
    技能CD: 16 * 20,
    造成伤害次数: 1,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '留',
    技能释放后添加GCD: 24,
    回复锐意: 0,
    造成伤害次数: 1,
    技能GCD组: '独立',
    技能类型: '单刀',
  },
  {
    技能名称: '断',
    技能释放后添加GCD: 24,
    造成伤害次数: 1,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '沧',
    技能释放后添加GCD: 24,
    造成伤害次数: 1,
    技能GCD组: '全部',
    技能类型: '双刀',
  },
  {
    技能名称: '横',
    技能释放后添加GCD: 24,
    技能CD: 16 * 12,
    造成伤害次数: 1,
    技能GCD组: '双刀',
    技能类型: '双刀',
  },
  {
    技能名称: '孤',
    技能释放后添加GCD: 24,
    造成伤害次数: 1,
    技能GCD组: '双刀',
    技能类型: '双刀',
  },
  {
    技能名称: '灭',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能CD: 16 * 20,
    技能GCD组: '独立',
    技能类型: '其他',
  },
  {
    技能名称: '吃影子',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能GCD组: '独立',
    技能类型: '其他',
  },
  {
    技能名称: '游',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能CD: 16 * 50,
    技能GCD组: '独立',
    技能类型: '其他',
  },
  {
    技能名称: '呆',
    技能释放后添加GCD: 24,
    造成伤害次数: 0,
    技能GCD组: '独立',
    技能类型: '其他',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
]

export const 技能GCD组 = {
  // 单刀和双刀之间相互不计算GCD
  // 全部对双刀和单刀都计算gcd
  // 独立只计算自己的GCD
  单刀: ['行', '停', '决', '决-识破', '断'],
  双刀: ['横', '孤'],
  全部: ['沧'],
  独立: ['留', '灭', '驰', '游'],
}

// Map预备数据
export const Buff数据: Buff枚举 = {
  戗风: { 名称: '戗风', 最大层数: 1, 最大持续时间: 16 * 8 },
  灭影随风: { 名称: '灭影随风', 最大层数: 1, 最大持续时间: 16 * 11 },
  破绽: { 名称: '破绽', 最大层数: 4, 最大持续时间: 16 * 30 },
  流血: { 名称: '流血', 最大层数: 4, 最大持续时间: 16 * 6 },
  长溯: { 名称: '长溯', 最大层数: 3, 最大持续时间: 16 * 30 },
  行链: { 名称: '行链', 最大层数: 1, 最大持续时间: 16 * 10 },
  沧链: { 名称: '沧链', 最大层数: 1, 最大持续时间: 16 * 3 },
}
