import { Buff枚举, CycleSimulatorSkillDTO, 日志类型 } from '@/@types/cycleSimulator'
import { 基础GCD帧, 每秒郭氏帧 } from '.'

const 循环模拟技能基础数据: CycleSimulatorSkillDTO[] = [
  {
    技能名称: '行',
    技能释放后添加GCD: 基础GCD帧,
    回复锐意: 5,
    造成伤害次数: 1,
    技能CD: 0,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '停',
    技能释放后添加GCD: 基础GCD帧,
    回复锐意: 10,
    造成伤害次数: 1,
    技能CD: 每秒郭氏帧 * 12,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '决',
    技能释放后添加GCD: 基础GCD帧,
    回复锐意: 25,
    技能CD: 每秒郭氏帧 * 20,
    造成伤害次数: 1,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '留',
    技能释放后添加GCD: 基础GCD帧,
    回复锐意: 0,
    造成伤害次数: 1,
    技能GCD组: '自身',
    技能类型: '单刀',
  },
  {
    技能名称: '断',
    技能释放后添加GCD: 基础GCD帧,
    造成伤害次数: 1,
    技能GCD组: '单刀',
    技能类型: '单刀',
  },
  {
    技能名称: '沧',
    技能释放后添加GCD: 基础GCD帧,
    造成伤害次数: 1,
    技能GCD组: '双刀',
    技能类型: '双刀',
  },
  {
    技能名称: '横',
    技能释放后添加GCD: 基础GCD帧,
    技能CD: 每秒郭氏帧 * 12,
    造成伤害次数: 1,
    技能GCD组: '双刀',
    技能类型: '双刀',
  },
  {
    技能名称: '孤',
    技能释放后添加GCD: 基础GCD帧,
    造成伤害次数: 1,
    技能GCD组: '双刀',
    技能类型: '双刀',
  },
  {
    技能名称: '灭',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 20,
    技能GCD组: '自身',
    技能类型: '其他',
  },
  {
    技能名称: '吃影子',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能GCD组: '自身',
    技能类型: '其他',
  },
  {
    技能名称: '游',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能CD: 每秒郭氏帧 * 50,
    最大充能层数: 2,
    技能GCD组: '自身',
    技能类型: '其他',
  },
  {
    技能名称: '呆',
    技能释放后添加GCD: 0,
    造成伤害次数: 0,
    技能类型: '其他',
  },
]

export default 循环模拟技能基础数据

export const 日志类型数组: 日志类型[] = [
  '释放技能',
  '自身buff变动',
  '目标buff变动',
  '造成伤害',
  '技能释放结果',
  '等CD',
]

export const 技能GCD组 = {
  流云势法: ['行', '停', '决', '断'],
  破浪三式: ['横', '沧', '孤'],
  自身: ['留', '灭', '驰', '游'],
}

// Map预备数据
export const 原始Buff数据: Buff枚举 = {
  识破: { 名称: '识破', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 30 },
  雨积: { 名称: '雨积', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 10 },
  戗风: { 名称: '戗风', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 8 },
  潋风: { 名称: '潋风', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 6 },
  灭影追风: { 名称: '灭影追风', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 11 },
  破绽: { 名称: '破绽', 最大层数: 4, 最大持续时间: 每秒郭氏帧 * 30 },
  流血: { 名称: '流血', 最大层数: 4, 最大持续时间: 每秒郭氏帧 * 6 },
  长溯: { 名称: '长溯', 最大层数: 3, 最大持续时间: 每秒郭氏帧 * 30 },
  行链: { 名称: '行链', 最大层数: 2, 最大持续时间: 每秒郭氏帧 * 10 },
  沧链: { 名称: '沧链', 最大层数: 2, 最大持续时间: 每秒郭氏帧 * 3 },
  身形: { 名称: '身形', 最大层数: 3, 最大持续时间: 每秒郭氏帧 * 10 },
  流岚: { 名称: '流岚', 最大层数: 1, 最大持续时间: 每秒郭氏帧 * 60 },
}
