import { GainTypeEnum } from '../../@types/enum'
import { SkillGainDTO } from '../../@types/skill'

const fenjiaoGainDTO: SkillGainDTO[] = [
  {
    增益名称: '3%伤害',
    增益类型: GainTypeEnum.伤害百分比,
    增益计算类型: 'a',
    增益数值: 0.03,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '4%伤害',
    增益类型: GainTypeEnum.伤害百分比,
    增益计算类型: 'a',
    增益数值: 0.04,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '5%伤害',
    增益类型: GainTypeEnum.伤害百分比,
    增益计算类型: 'a',
    增益数值: 0.05,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '3%会心',
    增益类型: GainTypeEnum.外攻会心百分比,
    增益计算类型: 'a',
    增益数值: 0.03,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '4%会心',
    增益类型: GainTypeEnum.外攻会心百分比,
    增益计算类型: 'a',
    增益数值: 0.04,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '5%会心',
    增益类型: GainTypeEnum.外攻会心百分比,
    增益计算类型: 'a',
    增益数值: 0.05,
    增益所在位置: '秘籍',
  },
  {
    增益名称: '中峙',
    增益类型: GainTypeEnum.伤害百分比,
    增益计算类型: 'a',
    增益数值: 0.1,
    增益所在位置: '奇穴',
  },
  {
    增益名称: '渊冲·会心',
    增益类型: GainTypeEnum.外攻会心百分比,
    增益计算类型: 'a',
    增益数值: 0.1,
    增益所在位置: '奇穴',
  },
  {
    增益名称: '渊冲·会效',
    增益类型: GainTypeEnum.外攻会心效果百分比,
    增益计算类型: 'a',
    增益数值: 0.1,
    增益所在位置: '奇穴',
  },
  {
    增益名称: '雨积',
    增益类型: GainTypeEnum.伤害百分比,
    增益计算类型: 'a',
    增益数值: 0.15,
    增益所在位置: '奇穴',
  },
]

export default fenjiaoGainDTO
